testing/benchmarks/tsung_angelic.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<!--
  tsung_angelic.xml — Tsung load test for AngelicKernel XMPP
  Corrected syntax: ts_jabber plugin, credentials via <options>, auth_sasl type.
-->

<tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="200"/>
  </clients>

  <servers>
    <server host="127.0.0.1" port="5222" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users interarrival="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users interarrival="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="14" unit="second">
      <users interarrival="0.2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users interarrival="9999" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="domain" value="angelic.local"/>
    <option name="jabber_login" value="user1"/>
    <option name="jabber_passwd" value="pass1"/>
  </options>

  <sessions>
    <session name="xmpp_muc_bench" probability="100" type="ts_jabber">

      <request><jabber type="connect" ack="local"/></request>
      <thinktime value="0.1"/>
      <request><jabber type="starttls" ack="local"/></request>
      <thinktime value="0.1"/>
      <request><jabber type="auth_sasl" ack="local"/></request>
      <thinktime value="0.1"/>
      <request><jabber type="open_stream" ack="local"/></request>
      <thinktime value="0.1"/>
      <request><jabber type="bind" ack="local"/></request>
      <thinktime value="0.1"/>
      <request><jabber type="session" ack="local"/></request>
      <thinktime value="0.1"/>
      <request><jabber type="presence" ack="no_ack"/></request>
      <thinktime value="0.2"/>

      <request>
        <jabber type="raw" ack="no_ack"><![CDATA[<presence to='benchroom@conference.angelic.local/bench%%ts_user_server%%'><x xmlns='http://jabber.org/protocol/muc'/></presence>]]></jabber>
      </request>
      <thinktime value="0.3"/>

      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m1%%ts_user_server%%'><body>load test 1</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m2%%ts_user_server%%'><body>load test 2</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m3%%ts_user_server%%'><body>load test 3</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m4%%ts_user_server%%'><body>load test 4</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m5%%ts_user_server%%'><body>load test 5</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m6%%ts_user_server%%'><body>load test 6</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m7%%ts_user_server%%'><body>load test 7</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m8%%ts_user_server%%'><body>load test 8</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m9%%ts_user_server%%'><body>load test 9</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m10%%ts_user_server%%'><body>load test 10</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m11%%ts_user_server%%'><body>load test 11</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m12%%ts_user_server%%'><body>load test 12</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m13%%ts_user_server%%'><body>load test 13</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m14%%ts_user_server%%'><body>load test 14</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m15%%ts_user_server%%'><body>load test 15</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m16%%ts_user_server%%'><body>load test 16</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m17%%ts_user_server%%'><body>load test 17</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m18%%ts_user_server%%'><body>load test 18</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m19%%ts_user_server%%'><body>load test 19</body></message>]]></jabber></request>
      <thinktime value="0.1"/>
      <request><jabber type="raw" ack="no_ack"><![CDATA[<message to='benchroom@conference.angelic.local' type='groupchat' id='m20%%ts_user_server%%'><body>load test 20</body></message>]]></jabber></request>
      <thinktime value="0.2"/>

      <request>
        <jabber type="raw" ack="no_ack"><![CDATA[<presence to='benchroom@conference.angelic.local/bench%%ts_user_server%%' type='unavailable'/>]]></jabber>
      </request>
      <thinktime value="0.1"/>
      <request>
        <jabber type="raw" ack="no_ack"><![CDATA[<presence type='unavailable'/>]]></jabber>
      </request>
      <request><jabber type="close" ack="no_ack"/></request>

    </session>
  </sessions>

</tsung>